import { Para, Title } from './style';

export const AboutCom = () => {
  return (
    <>
      <Title>About</Title>
      <Para>我叫姚伯骏，今年22岁，一个主前端的程序员</Para>
      <Para>
        我是一个终身学习者，我相信世界上的所有技能，想学都是可以学会的，并且学习是保持我生活清醒的重要来源
      </Para>
      <Para>
        我喜欢运动，例如羽毛球、游泳、爬山，我喜欢运动时大脑放空肆意舒展身体的感觉
      </Para>
      <Para>
        我喜欢阅读，但很多名著和历史我读不进去，我喜欢看有趣又能引起思考的东西，我喜欢并且擅长玩各类游戏，大学期间还打过比赛，但现阶段还是以提升自己和赚钱为主，等自己对现状满意后才会放纵自己
      </Para>
      <Para>
        在社交方面，我称不上是一个有魅力的人，但我懂得把握人与人之间的距离，至少不会让你感到难受
      </Para>
      <Title>Personal</Title>
      {/* <Para>
        我经常思考人生的意义，例如为什么我要活着，我还没有得出比较好的答案，有人跟我说这个问题需要耗费很多时间才能找到
      </Para>
      <Para></Para> */}
      <Para>这里不给看</Para>
    </>
  );
};
